docs/finance/策略.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2021-03-10 Wed 13:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>策略</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChrisChen" />
<meta name="keywords" content="Futures" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">策略</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5e6838b">1. 原则</a></li>
<li><a href="#org67a24bd">2. 回测</a>
<ul>
<li><a href="#org57b0e86">2.1. 数据查错</a></li>
<li><a href="#org8b8b6df">2.2. 回测价格选择</a></li>
<li><a href="#orga33d33a">2.3. 回测陷阱</a></li>
</ul>
</li>
<li><a href="#orge929bb5">3. 统计套利</a>
<ul>
<li><a href="#org5e2342c">3.1. 状态转换</a></li>
<li><a href="#org82f19a0">3.2. 平稳性与协整性</a></li>
<li><a href="#org0b7bae5">3.3. 因子模型</a></li>
<li><a href="#orge28f05f">3.4. 策略清仓逻辑</a></li>
<li><a href="#org53b261e">3.5. 均值回归or惯性策略</a></li>
</ul>
</li>
<li><a href="#org0b91ce5">4. 策略表现评估</a>
<ul>
<li><a href="#orgfa71c81">4.1. 平均年化收益率</a></li>
<li><a href="#orge4a17ec">4.2. 回撤</a></li>
<li><a href="#org4427d30">4.3. 夏普比率</a></li>
<li><a href="#orgf636fc7">4.4. 业绩随时间而变化</a></li>
</ul>
</li>
<li><a href="#org3e1ea05">5. 策略改进</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5e6838b" class="outline-2">
<h2 id="org5e6838b"><span class="section-number-2">1</span> 原则</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>挖掘数据</li>
</ol>
</div>
</div>
<div id="outline-container-org67a24bd" class="outline-2">
<h2 id="org67a24bd"><span class="section-number-2">2</span> 回测</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org57b0e86" class="outline-3">
<h3 id="org57b0e86"><span class="section-number-3">2.1</span> 数据查错</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>简单方法：算日收益，对偏离均值 4 个标准差的收益需要仔细检查；一般而言，极端收益与消息发布或市场指数异动有关，否则就是数据本身问题</li>
<li>另外还可以算一下不同价格组合的日收益(比如昨天的最高价和今天的收盘价)</li>
</ul>
</div>
</div>

<div id="outline-container-org8b8b6df" class="outline-3">
<h3 id="org8b8b6df"><span class="section-number-3">2.2</span> 回测价格选择</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>最高，最低价的噪声远大于开收盘价，故一般选用收盘价</li>
</ul>
</div>
</div>

<div id="outline-container-orga33d33a" class="outline-3">
<h3 id="orga33d33a"><span class="section-number-3">2.3</span> 回测陷阱</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org4085ac2" class="outline-4">
<h4 id="org4085ac2"><span class="section-number-4">2.3.1</span> 前视偏差</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
验证是否有前视偏差：全数据产生策略持仓数据，然后删除最近 N 天再次生成，再比较两者是否一致
</p>
</div>
</div>

<div id="outline-container-orgfa3d217" class="outline-4">
<h4 id="orgfa3d217"><span class="section-number-4">2.3.2</span> <b>数据迁就偏差</b></h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>策略 <b>规则</b> 越多、 <b>参数</b> 越多，因为条件更难以达到，所以更容易产生过拟合。</li>
<li>能经得住时间考验的往往是简单的模型(奥卡姆剃刀原理)</li>
<li>K 线独立数据量有限，很容易产生数据迁就偏差</li>
<li>如发生金融系统的状态转变，近几年的旧数据也无法使用</li>
<li>独立数据的量越少，交易模型中用到的调整参数就应该越少</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="orgb905d3e"></a>优化样本数量<br />
<div class="outline-text-5" id="text-orgb905d3e">
<p>
根据经验法则，优化参数所需的数据点个数是模型中自由参数个数的 252 倍。
</p>
<ul class="org-ul">
<li>参数包括如建仓清仓阈值、持有期限等定量指标</li>
<li>回测三个参数的日交易模型，至少要用三年(252 个交易日)的日价格数据</li>
<li>尝试尽可能减少策略中的规则和参数</li>
</ul>
</div>
</li>

<li><a id="org6cb4572"></a>样本外数据<br />
<div class="outline-text-5" id="text-org6cb4572">
<p>
历史数据根据时间先后分为两段，前一段数据为训练集，后一段数据为测试集，两段数据大小要大致相等
</p>
<ul class="org-ul">
<li>数据量不够，则至少用三分之一的数据做测试</li>
<li>训练集训练出的参数在测试集上的业绩起码要合理，否则存在数据迁就偏差，需要进一步优化并减少参数</li>
<li>动态参数优化：移动窗口</li>
</ul>
</div>
</li>
</ul>
</div>

<div id="outline-container-org1c6e4f4" class="outline-4">
<h4 id="org1c6e4f4"><span class="section-number-4">2.3.3</span> 流动性成本</h4>
<div class="outline-text-4" id="text-2-3-3">
<ul class="org-ul">
<li>常用指标：过去一段时间平均日交易量，单个指令的股数不宜超过平均日交易量的1%</li>
<li>常用指标2：通过市值决定指令规模</li>
</ul>
</div>
</div>

<div id="outline-container-orge487246" class="outline-4">
<h4 id="orge487246"><span class="section-number-4">2.3.4</span> 滑价</h4>
<div class="outline-text-4" id="text-2-3-4">
<ul class="org-ul">
<li>触发交易信号的价格与全部指令平均执行价格的差</li>
<li>拆单减少市场冲击的同时增加了滑价</li>
</ul>
</div>
</div>

<div id="outline-container-org29db39d" class="outline-4">
<h4 id="org29db39d"><span class="section-number-4">2.3.5</span> 市场状态转换</h4>
</div>
</div>
</div>

<div id="outline-container-orge929bb5" class="outline-2">
<h2 id="orge929bb5"><span class="section-number-2">3</span> 统计套利</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5e2342c" class="outline-3">
<h3 id="org5e2342c"><span class="section-number-3">3.1</span> 状态转换</h3>
<div class="outline-text-3" id="text-3-1">
<p>
常被研究的状态转换
</p>
<ul class="org-ul">
<li>牛熊转换</li>
<li>通货膨胀与经济衰退状态</li>
<li>高波动率与低波动率状态：最适合用计量经济学工具，如GARCH模型</li>
<li>均值回归与趋势状态</li>
</ul>
</div>

<div id="outline-container-org3f06943" class="outline-4">
<h4 id="org3f06943"><span class="section-number-4">3.1.1</span> 建模思路</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>假设价格在两个（或多个）状态上的概率分布不同。简单举例：两个状态的价格都服从对数正态分布，但均值或标准差不同</li>
<li>假设状态之间存在某种转移概率</li>
<li>使用类似最大似然估计这样的统计方法，通过拟合历史数据，来确定状态概率分布和转移概率的参数</li>
<li>根据上述拟合模型，找出下一个时间步长的期望状态</li>
</ol>

<p>
这种方法被成为“马尔科夫状态转换模型”或“隐马尔科夫模型”，这一模型基于贝叶斯概率框架
</p>
<ul class="org-ul">
<li>模型假设状态之间的转移概率都是固定的，意味着在任何时候股票从正常的静止状态转移到不稳定状态的概率非常小，对实际交易无用。进一步需要用到拐点模型</li>
<li><b>拐点模型</b> 使用了数据挖掘方法：输入所有可能预测拐点或状态转换的变量，例如当前的波动率、最近一期收益、情绪指数、宏观经济数据的变化等</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org82f19a0" class="outline-3">
<h3 id="org82f19a0"><span class="section-number-3">3.2</span> 平稳性与协整性</h3>
</div>
<div id="outline-container-org0b7bae5" class="outline-3">
<h3 id="org0b7bae5"><span class="section-number-3">3.3</span> 因子模型</h3>
</div>

<div id="outline-container-orge28f05f" class="outline-3">
<h3 id="orge28f05f"><span class="section-number-3">3.4</span> 策略清仓逻辑</h3>
<div class="outline-text-3" id="text-3-4">
<p>
建仓逻辑一般是特定的，清仓逻辑并无太大区别，主要有：
</p>
<ul class="org-ul">
<li>固定持有期</li>
<li>目标价格或盈利上限</li>
<li>最新的建仓信号</li>
<li>止损价格</li>
</ul>
</div>
</div>

<div id="outline-container-org53b261e" class="outline-3">
<h3 id="org53b261e"><span class="section-number-3">3.5</span> 均值回归or惯性策略</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org0a89257" class="outline-4">
<h4 id="org0a89257"><span class="section-number-4">3.5.1</span> 价格的“分形”性质</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li>构建一个策略实际上是要判断，在 <b>特定条件</b> 和 <b>特定时间段</b> ，价格究竟是均值回归还是趋势的</li>
<li>价格同一时间既可以是均值回归的也可以是趋势的，即具有“分形”性质</li>
<li>技术分析者喜欢用艾略特波浪理论来分析这种现象</li>
</ul>
</div>
</div>

<div id="outline-container-org4d1378c" class="outline-4">
<h4 id="org4d1378c"><span class="section-number-4">3.5.2</span> 均值回归</h4>
<div class="outline-text-4" id="text-3-5-2">
<ul class="org-ul">
<li>数学理论基础：时间序列的平稳性和协整性的概念</li>
<li>平稳价格序列对均值回归交易非常理想</li>
<li>竞争者的加入会减少均值回归交易的机会</li>
<li>对于均值回归策略，可以用更加具有统计可靠性的方法决定交易的最优持有期，可以运用Ornstein-Uhlenbeck公式建模</li>
</ul>
</div>
</div>

<div id="outline-container-orgf9930c8" class="outline-4">
<h4 id="orgf9930c8"><span class="section-number-4">3.5.3</span> 惯性策略</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
产生惯性的原因：
</p>
<ul class="org-ul">
<li>信息的缓慢扩散</li>
<li>大额指令因流动性需求分拆执行</li>
<li>投资者的羊群效应</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org60eb7cd"></a>惯性策略特点<br />
<div class="outline-text-5" id="text-org60eb7cd">
<ul class="org-ul">
<li>最优持有期会因为信息扩散的速度加快，同类策略的增加而缩短</li>
<li>惯性状态的时间周期是极难预测的</li>
<li>在事件驱动的惯性策略上，没有可靠的量化方法来决定最有持有期</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org0b91ce5" class="outline-2">
<h2 id="org0b91ce5"><span class="section-number-2">4</span> 策略表现评估</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfa71c81" class="outline-3">
<h3 id="orgfa71c81"><span class="section-number-3">4.1</span> 平均年化收益率</h3>
<div class="outline-text-3" id="text-4-1">
<p>
需关注分母的说明
</p>
<ul class="org-ul">
<li>多空策略中，分母用一个方向的资本还是两个方向的</li>
<li>收益率是杠杆收益率(分母账户净值)还是无杠杆收益率(分母投资组合的市场价值)</li>
</ul>
</div>
</div>

<div id="outline-container-orge4a17ec" class="outline-3">
<h3 id="orge4a17ec"><span class="section-number-3">4.2</span> 回撤</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>t 时刻回撤定义：当前净值与 t 时刻或之前的净值曲线最大值之差</li>
<li>最大回撤：是指净值曲线最大值与之后的净值曲线最小值之差</li>
</ul>
</div>
</div>

<div id="outline-container-org4427d30" class="outline-3">
<h3 id="org4427d30"><span class="section-number-3">4.3</span> 夏普比率</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>信息比率：（组合收益率 - 基准收益率）/ 超额收益率的标准差</li>
<li>夏普比率是信息比率的一个特例，基准取无风险利率，多种策略比较时更适用</li>
<li>仅当策略有资金成本时才需要减掉无风险利率。例如无隔夜头寸的纯多头当日交易策略就没有资金成本</li>
<li>货币中性策略无需计算无风险利率，卖空的现金买入另一腿证券，换言之其是自融资的</li>
</ul>
</div>

<div id="outline-container-orge4e776f" class="outline-4">
<h4 id="orge4e776f"><span class="section-number-4">4.3.1</span> 年化夏普比率计算</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
sharpe = sqrt(T) * 基于 T 的夏普比率。例如：策略只在纽交所交易时间(6.5h)内持仓，每小时收益率 R，每小时标准差 s，则年化夏普比率为 sqrt(252*6.5)*R/s
</p>
<ul class="org-ul">
<li>日收益算夏普：sqrt(252) * ret_mean / ret_std</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgf636fc7" class="outline-3">
<h3 id="orgf636fc7"><span class="section-number-3">4.4</span> 业绩随时间而变化</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>市场流动性随时间而变化，策略交易成本需根据当时情况预估</li>
<li>金融市场的“状态转换”，金融时间序列是非平稳的</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3e1ea05" class="outline-2">
<h2 id="org3e1ea05"><span class="section-number-2">5</span> 策略改进</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>难点：如何在改进时，不引进数据迁就偏差，并保持少参数的简单模型，更像是艺术而非科学</li>
<li>原则：任何策略改进要同时提高训练集和测试集的业绩</li>
</ul>
</div>
</div>
</div>
</body>
</html>
